In [1]:
import pandas as pd

In [4]:
titanic = pd.read_csv('c:/users/algorithmica/python/titanic.csv')
print(titanic.shape)
titanic.info()

(891, 12)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [8]:
titanic.Survived = titanic.Survived.astype('category')
titanic.Sex = titanic.Sex.astype('category')
titanic.Pclass = titanic.Pclass.astype('category')
titanic.Embarked = titanic.Embarked.astype('category')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null category
Pclass         891 non-null category
Name           891 non-null object
Sex            891 non-null category
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null category
dtypes: category(4), float64(2), int64(3), object(3)
memory usage: 59.7+ KB

In [9]:
titanic.describe()

       PassengerId         Age       SibSp       Parch        Fare
count   891.000000  714.000000  891.000000  891.000000  891.000000
mean    446.000000   29.699118    0.523008    0.381594   32.204208
std     257.353842   14.526497    1.102743    0.806057   49.693429
min       1.000000    0.420000    0.000000    0.000000    0.000000
25%     223.500000   20.125000    0.000000    0.000000    7.910400
50%     446.000000   28.000000    0.000000    0.000000   14.454200
75%     668.500000   38.000000    1.000000    0.000000   31.000000
max     891.000000   80.000000    8.000000    6.000000  512.329200

In [11]:
print(titanic.Age.mean())
print(titanic.Fare.max())

29.69911764705882
512.3292

In [12]:
print(titanic.mean())

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [15]:
#Find the mean fare for male and female passengers separately
print(titanic[titanic.Sex=='male']['Fare'].mean())
print(titanic[titanic.Sex=='female']['Fare'].mean())

25.523893414211418
44.47981783439487

In [16]:
#Find the mean fare of passengers class wise
print(titanic[titanic.Pclass==1]['Fare'].mean())
print(titanic[titanic.Pclass==2]['Fare'].mean())
print(titanic[titanic.Pclass==3]['Fare'].mean())

84.15468749999992
20.66218315217391
13.675550101832997

In [18]:
#group by meaning
gres = titanic.groupby('Sex')
print(gres)
for (val, df) in gres:
    print(val, df)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000287A8065D88>
female      PassengerId Survived Pclass  \
1              2        1      1
2              3        1      3
3              4        1      1
8              9        1      3
9             10        1      2
..           ...      ...    ...
880          881        1      2
882          883        0      3
885          886        0      3
887          888        1      1
888          889        0      3

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
..                                                 ...     ...   ...    ...
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1

     Parch            Ticket     Fare Cabin Embarked
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
8        2            347742  11.1333   NaN        S
9        0            237736  30.0708   NaN        C
..     ...               ...      ...   ...      ...
880      1            230433  26.0000   NaN        S
882      0              7552  10.5167   NaN        S
885      5            382652  29.1250   NaN        Q
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S

[314 rows x 12 columns]
male      PassengerId Survived Pclass                            Name   Sex   Age  \
0              1        0      3         Braund, Mr. Owen Harris  male  22.0
4              5        0      3        Allen, Mr. William Henry  male  35.0
5              6        0      3                Moran, Mr. James  male   NaN
6              7        0      1         McCarthy, Mr. Timothy J  male  54.0
7              8        0      3  Palsson, Master. Gosta Leonard  male   2.0
..           ...      ...    ...                             ...   ...   ...
883          884        0      2   Banfield, Mr. Frederick James  male  28.0
884          885        0      3          Sutehall, Mr. Henry Jr  male  25.0
886          887        0      2           Montvila, Rev. Juozas  male  27.0
889          890        1      1           Behr, Mr. Karl Howell  male  26.0
890          891        0      3             Dooley, Mr. Patrick  male  32.0

     SibSp  Parch            Ticket     Fare Cabin Embarked
0        1      0         A/5 21171   7.2500   NaN        S
4        0      0            373450   8.0500   NaN        S
5        0      0            330877   8.4583   NaN        Q
6        0      0             17463  51.8625   E46        S
7        3      1            349909  21.0750   NaN        S
..     ...    ...               ...      ...   ...      ...
883      0      0  C.A./SOTON 34068  10.5000   NaN        S
884      0      0   SOTON/OQ 392076   7.0500   NaN        S
886      0      0            211536  13.0000   NaN        S
889      0      0            111369  30.0000  C148        C
890      0      0            370376   7.7500   NaN        Q

[577 rows x 12 columns]

In [19]:
print(titanic.groupby('Sex')['Fare'].mean())

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [20]:
print(titanic.groupby('Pclass')['Fare'].mean())

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [21]:
print(titanic.groupby(['Sex', 'Pclass'])['Fare'].mean())

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

In [22]:
#performing multiple aggregates
import numpy as np
print(titanic.groupby('Sex')['Fare'].aggregate([min, max, np.mean]))

         min       max       mean
Sex
female  6.75  512.3292  44.479818
male    0.00  512.3292  25.523893